src/main/resources/example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brok="http://tinkoff.ru/svyaznoy/broker">
    <soapenv:Header/>
    <soapenv:Body>
        <brok:confirmOffer>
            <confirmOfferRequest>
                <applicationId>?</applicationId>
                <cardEAN>?</cardEAN>
                <branchId>?</branchId>
                <staffId>?</staffId>
            </confirmOfferRequest>
        </brok:confirmOffer>
    </soapenv:Body>
</soapenv:Envelope>